---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance.Origin
zh: 原点
source: html/e22ecee3-e31b-c04f-c176-50496c8c2865.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance.Origin Property

**中文**: 原点

The sheet instance offset in drawing sheet coordinates.

## Syntax (C#)
```csharp
public XYZ Origin { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null